[M_GrandmotherHouse MissionDefinition]
TurnInDescription="Some other proposed titles for this mission: ''Grandma Knows Best,'' ''Grandma Was a Rolling Stone,'' and, ''It Turns out Jack Isn't Leading You into a Trap at All, He Just Has Deep-Seated Grandma Issues.''"
MissionSummary="Check on Handsome Jack's grandmother."
